--- a/AI/README.md
+++ b/AI/README.md
@@ -59,42 +63,43 @@ Following are the four essential properties of search algorithms to compare the 
+
 ### Types of Search Algorithms
 
-```plantuml
+```mermaid
 
-@startuml
+classDiagram
+    class SearchAlgorithm
 
-!define RECTANGLE class
-RECTANGLE "Search Algorithm" as SA
+    class Uninformed {
+        1. Breadth-first Search
+        2. Depth-first Search
+        3. Depth-limited Search
+        4. Iterative deepening depth-first search
+        5. Uniform cost search
+        6. Bidirectional Search
+    }
 
-RECTANGLE "Uninformed" as Uninformed {
- 1. Breadth-first Search
- 2. Depth-first Search
- 3. Depth-limited Search
- 4. Iterative deepening depth-first search
- 5. Uniform cost search
- 6. Bidirectional Search
-}
+    class Informed {
+        1. Greedy Best First Search Algorithm
+        2. A* Search Algorithm
+        3. Hill Climbing
+    }
 
-RECTANGLE "Informed" as Informed {
- 1. Greedy Best First Search Algorithm
- 2. A* Search Algorithm
- 3. Hill Climbing
-}
+    class Adversarial {
+        1. Minimax search
+        2. Depth Limited Minimax
+        3. Alpha-beta pruning
+    }
 
-RECTANGLE "Adversarial Search" as Adversarial {
- 1. Minimax search
- 2. Depth Limited Minimax
- 3. Alpha-beta pruning
-}
-
-SA -down-> Uninformed
-SA -down-> Informed
-SA -down-> Adversarial
-@enduml
+    SearchAlgorithm --> Uninformed
+    SearchAlgorithm --> Informed
+    SearchAlgorithm --> Adversarial
 
 ```
+
+---
 
